export const REVALIDATE_TIME = 3600 * 3; //3時間

type StationAreaType = {
  [key: string]: { NAME: string; PLACE: string }[];
};

export const STATION_AREA: StationAreaType = {
  東京: [
    { NAME: "東京", PLACE: "&lat=35.68146275605016&lng=139.76710333847444" },
    { NAME: "新宿", PLACE: "&lat=35.68990826919419lng=139.70058645160987" },
    { NAME: "渋谷", PLACE: "&lat=35.658182066464185&lng=139.701592880803364" },
    { NAME: "池袋", PLACE: "&lat=35.72980113647696&lng=139.71083213431248" },
    { NAME: "下北沢", PLACE: "&lat=35.66183756248904&lng=139.6668381519685" },
    { NAME: "品川", PLACE: "&lat=35.62868056481697&lng=139.73869532313222" },
    { NAME: "上野", PLACE: "&lat=35.714315262208316&lng=139.77749492682557" },
    { NAME: "秋葉原", PLACE: "&lat=35.69856754301279&lng=139.77308169031997" },
  ],
  神奈川: [
    { NAME: "横浜", PLACE: "&lat=35.46614709846472&lng=139.6220941835044" },
    { NAME: "川崎", PLACE: "&lat=35.53073706492997&lng=139.6991484701125" },
    { NAME: "藤沢", PLACE: "&lat=35.33924689179307&lng=139.48743110072257" },
    { NAME: "湘南台", PLACE: "&lat=35.396469696428674&lng=139.46650332584923" },
    { NAME: "菊名", PLACE: "&lat=35.51010287453275&lng=139.63140068264235" },
  ],
  千葉: [
    { NAME: "千葉", PLACE: "&lat=35.61333935627726&lng=140.11338261137357" },
    { NAME: "船橋", PLACE: "&lat=35.70192734781643&lng=139.9853385816819" },
  ],
  埼玉: [
    {
      NAME: "さいたま新都心",
      PLACE: "&lat=35.893951419096&lng=139.63376245470283",
    },
    { NAME: "大宮", PLACE: "&lat=35.906700484889264&lng=139.62376896634646" },
    { NAME: "川越", PLACE: "&lat=35.90741004688521&lng=139.48273277791665" },
  ],
  茨城: [
    { NAME: "水戸", PLACE: "&lat=36.37085327547122&lng=140.47621392703562" },
    { NAME: "つくば", PLACE: "&lat=36.0828492663303&lng=140.11154604121663" },
  ],
  栃木: [
    { NAME: "宇都宮", PLACE: "&lat=36.5591784938131&lng=139.8984510970558" },
  ],
  北海道: [
    { NAME: "札幌", PLACE: "&lat=43.068809489150645&lng=141.35069092430044" },
    { NAME: "函館", PLACE: "&lat=41.77390039156025&lng=140.7265062837672" },
    { NAME: "小樽", PLACE: "&lat=43.197901524068065&lng=140.99376559831978" },
    { NAME: "旭川", PLACE: "&lat=43.76293233723581&lng=142.358574869512" },
    // { NAME: "帯広", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "釧路", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "北見", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "苫小牧", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "室蘭", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  青森: [
    { NAME: "青森", PLACE: "&lat=40.82904100657451&lng=140.7342744972215" },
    // { NAME: "八戸", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  岩手: [
    { NAME: "盛岡", PLACE: "&lat=39.70188829174318&lng=141.13660877726957" },
    // { NAME: "花巻", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  宮城: [
    { NAME: "仙台", PLACE: "&lat=38.30101884862292&lng=140.87756600640927" },
    // { NAME: "石巻", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "古川", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  秋田: [
    { NAME: "秋田", PLACE: "&lat=39.71709363156402&lng=140.12972906834116" },
    // { NAME: "大館", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  山形: [
    { NAME: "山形", PLACE: "&lat=38.249052656673605&lng=140.32732425479097" },
    // { NAME: "米沢", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  福島: [
    { NAME: "福島", PLACE: "&lat=37.75433102963549&lng=140.45919493942932" },
    // { NAME: "郡山", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "会津若松", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  群馬: [
    { NAME: "前橋", PLACE: "&lat=36.38353748513346&lng=139.07308407412847" },
    // { NAME: "高崎", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  愛知: [
    { NAME: "名古屋", PLACE: "&lat=35.17105529506329&lng=136.8815476258411" },
    { NAME: "豊橋", PLACE: "&lat=34.76311397926566&lng=137.3819212961079" },
    { NAME: "金山", PLACE: "&lat=35.143154074862984&lng=136.90118203845296" },
  ],
  岐阜: [
    { NAME: "岐阜", PLACE: "&lat=35.40970265926052&lng=136.7564119528356" },
    // { NAME: "大垣", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  三重: [
    { NAME: "津", PLACE: "&lat=34.73418644719341&lng=136.5102648546613" },
    // { NAME: "四日市", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "伊勢市", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  静岡: [
    { NAME: "静岡", PLACE: "&lat=34.972301262686976&lng=138.38885758165569" },
    // { NAME: "浜松", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "沼津", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "富士", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  大阪: [
    { NAME: "大阪", PLACE: "&lat=34.70266178040135&lng=135.49598278349578" },
    { NAME: "新大阪", PLACE: "&lat=34.73361566313018&lng=135.50026542494194" },
    { NAME: "天王寺", PLACE: "&lat=34.647418941909315&lng=135.5138762166881" },
    { NAME: "梅田", PLACE: "&lat=34.703362899221446&lng=135.4976200135809" },
    { NAME: "なんば", PLACE: "&lat=34.6672633864923&lng=135.5003493848477" },
  ],
  京都: [
    { NAME: "京都", PLACE: "&lat=34.99749847718123&lng=135.75984592854374" },
    // { NAME: "烏丸", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "伏見稲荷", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  兵庫: [
    { NAME: "神戸", PLACE: "&lat=34.679642937028824&lng=135.17826944350378" },
    { NAME: "姫路", PLACE: "&lat=34.826884743938116&lng=134.69053259611056" },
    { NAME: "尼崎", PLACE: "&lat=34.73235894123092&lng=135.43168480255912" },
    { NAME: "御影", PLACE: "&lat=34.71522836133116&lng=135.25614766358714" },
  ],
  奈良: [
    { NAME: "奈良", PLACE: "&lat=34.680971381254594&lng=135.81888782397402" },
    // { NAME: "大和西大寺", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  滋賀: [
    { NAME: "大津", PLACE: "&lat=35.00355332451122&lng=135.8645904258352" },
    // { NAME: "彦根", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  和歌山: [
    { NAME: "和歌山", PLACE: "&lat=34.23359486474839&lng=135.1914303686771" },
    // { NAME: "海南", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  岡山: [
    { NAME: "岡山", PLACE: "&lat=34.6662800364987&lng=133.91774422883566" },
    // { NAME: "倉敷", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "津山", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  広島: [
    { NAME: "広島", PLACE: "&lat=34.48827008247727&lng=132.50284433705522" },
    // { NAME: "福山", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "呉", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "三原", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  鳥取: [
    { NAME: "鳥取", PLACE: "&lat=35.494208916316026&lng=134.22588576818137" },
    // { NAME: "米子", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  島根: [
    { NAME: "松江", PLACE: "&lat=35.51546486533711&lng=133.072135404661" },
    // { NAME: "出雲市", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "浜田", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  山口: [
    { NAME: "下関", PLACE: "&lat=33.949575370694106&lng=130.92175648161975" },
    { NAME: "新山口", PLACE: "&lat=34.09390490773365&lng=131.3963325095773" },
    { NAME: "湯田温泉", PLACE: "&lat=34.1600497522923&lng=131.46057274025958" },
    { NAME: "宇部", PLACE: "&lat=34.00320314740478&lng=131.2217295960787" },
    { NAME: "岩国", PLACE: "&lat=34.172152057262146&lng=132.2251034979302" },
  ],
  福岡: [
    { NAME: "博多", PLACE: "&lat=33.58995984385165&lng=130.42065229510027" },
    // { NAME: "小倉", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
    // { NAME: "久留米", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  佐賀: [
    { NAME: "佐賀", PLACE: "&lat=33.26432877899019&lng=130.2973860681032" },
    // { NAME: "唐津", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  長崎: [
    { NAME: "長崎", PLACE: "&lat=32.75251922868075&lng=129.86895922575727" },
    // { NAME: "佐世保", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  熊本: [
    { NAME: "熊本", PLACE: "&lat=32.79185283493267&lng=130.6900012293998" },
    // { NAME: "八代", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  大分: [
    { NAME: "大分", PLACE: "&lat=33.233339755400785&lng=131.6064239834448" },
    // { NAME: "別府", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  宮崎: [
    { NAME: "宮崎", PLACE: "&lat=31.91584967777452&lng=131.4322318257295" },
    // { NAME: "延岡", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  鹿児島: [
    {
      NAME: "鹿児島中央",
      PLACE: "&lat=31.583868658233804&lng=130.54127595591615",
    },
  ],
  沖縄: [
    { NAME: "那覇", PLACE: "&lat=26.21112216724983&lng=127.68313306174889" },
  ],
  徳島: [
    { NAME: "徳島", PLACE: "&lat=34.07440342270116&lng=134.551082895117" },
  ],
  香川: [
    { NAME: "高松", PLACE: "&lat=34.350918631191426&lng=134.04685299512676" },
  ],
  愛媛: [
    { NAME: "松山", PLACE: "&lat=33.84109514515875&lng=132.75145016072804" },
  ],
  高知: [
    { NAME: "高知", PLACE: "&lat=33.56743271216247&lng=133.5436022844966" },
    // { NAME: "須崎", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  新潟: [
    { NAME: "新潟", PLACE: "&lat=37.912216555726786&lng=139.06172135566092" },
    // { NAME: "長岡", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  長野: [
    { NAME: "長野", PLACE: "&lat=36.643339483988015&lng=138.1886007817161" },
    // { NAME: "松本", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  山梨: [
    { NAME: "甲府", PLACE: "&lat=35.666804612219934&lng=138.56878531236586" },
  ],
  福井: [
    { NAME: "福井", PLACE: "&lat=36.061789140664175&lng=136.22353486820208" },
  ],
  石川: [
    { NAME: "金沢", PLACE: "&lat=36.57822523048604&lng=136.64823577301408" },
    // { NAME: "小松", PLACE: "&lat=ああああああああああ&lng=いいいいいいいいいい" },
  ],
  富山: [
    { NAME: "富山", PLACE: "&lat=36.702016014169025&lng=137.21260433938977" },
  ],
};
